

# print("나는 %d 살입니다." % 24)
# print("나는 %s 이고 %d 살입니다" %("홍길동", 24))
# print("나는 {} 이고 {} 살입니다" .format("홍길동", 24))
# print("나는 {1} 이고 {0} 살입니다" .format("홍길동", 24))
#print("나는 {name} 이고 {age} 살입니다" .format(name = "홍길동", age = 24))



text = """
오늘의 온도는 {0:>10}도 이고, 습도는 {1:<10}도 입니다.
내일의 온도는 {2:^10}도 이고, 습도는 {3:-^10}도 입니다.
""".format(30, 70, 28,69)
# print(text)

text = """
오늘의 온도는 %s도 이고, 습도는 %s도 입니다.
내일의 온도는 %s도 이고, 습도는 %s도 입니다.
"""%(30, 70, 28,69)
# print(text)

age = 24
name = "홍길동"
# print(f"나는 {name} 이고 {age} 살입니다")

text2 = f"나는 {name} 이고 {age:0.4f} 살입니다"
print(text2)